src/Documents/ПеремещениеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПеремещениеЗапасов</Name>
			<BasedOn>
				<xr:Item>Document.Поступление</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиницаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ПеремещениеЗапасов/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаЗаполнения" объекта
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Поступление") Тогда
		
		ДокументОснование = ДанныеЗаполнения;
		Склад = ДанныеЗаполнения.Склад;
		СтруктурнаяЕдиница = ДанныеЗаполнения.СтруктурнаяЕдиница;
		Запасы.Загрузить(ДанныеЗаполнения.Запасы.Выгрузить());
		
	КонецЕсли;		
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события "ПриКопировании" объекта
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, ОбъектКопирования);
	                       
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	// Инициализация дополнительных свойств для проведения документа.
	ДвиженияДокументовСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.ПеремещениеЗапасов.УстановитьНачальныеДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	УправлениеЗапасамиПартионныйУчет.СформироватьСписаниеТаблицаПартииТоваров(Ссылка.Запасы, ДополнительныеСвойства, Движения, Отказ);
	// Движения по регистрам
	ДвиженияДокументовСервер.ЗапасыНаСкладах(ДополнительныеСвойства, Движения, Отказ);   	
	ДвиженияДокументовСервер.ПартииТоваров(ДополнительныеСвойства, Движения, Отказ);
	ТаблицаУправленческийДобавитьДвиженияПоПартиям(ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий
	                                              ,ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПартииТоваров);
	ДвиженияДокументовСервер.Управленческий(ДополнительныеСвойства, Движения, Отказ);
	// Запись наборов записей.
	ДвиженияДокументовСервер.ДобавитьНаборыЗаписей(ЭтотОбъект);

КонецПроцедуры

// Процедура - Обработка проверки заполнения
//
// Параметры:
//  Отказ				 - 	 - 
//  ПроверяемыеРеквизиты - 	 - 
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Отказ = УправлениеЗапасамиПартионныйУчет.КонтрольОтрицательныхОстатков(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура добавляет необходимы движения по партиям 
// в таблицу движений регистра управленческий
Процедура ТаблицаУправленческийДобавитьДвиженияПоПартиям(ТаблицаУправленческий, ТаблицаПартии)	
	
	ВременнаяТаблица = ТаблицаПартии.Скопировать();
    ВременнаяТаблица.Свернуть("Номенклатура,Склад,ВидДвижения","Стоимость,Количество");	
	Для Каждого СтрокаТ ИЗ ВременнаяТаблица Цикл
		Если СтрокаТ.ВидДвижения = ВидДвиженияНакопления.Расход Тогда
			НайденныеСтроки = ТаблицаУправленческий.НайтиСтроки(Новый Структура("СубконтоКт1,СубконтоКт2",СтрокаТ.Номенклатура,СтрокаТ.Склад));
			Если НайденныеСтроки.Количество() > 0 Тогда
				НайденныеСтроки[0].Сумма              = СтрокаТ.Стоимость;
				НайденныеСтроки[0].Количество         = СтрокаТ.Количество;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;		
КонецПроцедуры

#КонецОбласти
